In [1]:
import numpy as np
import pandas as pd

In [2]:
np.set_printoptions

In [3]:
np.set_printoptions(precision=2)

**Считываем данные из файла**

In [7]:
data = pd.read_csv('../../data/beauty.csv', sep=';')

In [8]:
type(data)

pandas.core.frame.DataFrame

**Смотрим на первые 5 строк**

In [9]:
data.head()

    wage  exper  union  goodhlth  black  female  married  service  educ  looks
0   5.73     30      0         1      0       1        1        1    14      4
1   4.28     28      0         1      0       1        1        0    12      3
2   7.96     35      0         1      0       1        0        0    10      4
3  11.57     38      0         1      0       0        1        1    16      3
4  11.42     27      0         1      0       0        1        0    16      3

In [10]:
data.shape

(1260, 10)

**Краткая статистика – info и describe**

In [15]:
data['exper'] = data['exper'].astype('int64')

In [16]:
data.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 1260 entries, 0 to 1259
Data columns (total 10 columns):
wage        1260 non-null float64
exper       1260 non-null int64
union       1260 non-null int64
goodhlth    1260 non-null int64
black       1260 non-null int64
female      1260 non-null int64
married     1260 non-null int64
service     1260 non-null int64
educ        1260 non-null int64
looks       1260 non-null int64
dtypes: float64(1), int64(9)
memory usage: 98.5 KB

In [17]:
data.describe()

,wage,exper,union,goodhlth,black,female,married,service,educ,looks
count,1260.00,1260.00,1260.00,1260.00,1260.00,1260.00,1260.00,1260.00,1260.00,1260.00
mean,6.31,18.21,0.27,0.93,0.07,0.35,0.69,0.27,12.56,3.19
std,4.66,11.96,0.45,0.25,0.26,0.48,0.46,0.45,2.62,0.68
min,1.02,0.00,0.00,0.00,0.00,0.00,0.00,0.00,5.00,1.00
25%,3.71,8.00,0.00,1.00,0.00,0.00,0.00,0.00,12.00,3.00
50%,5.30,15.00,0.00,1.00,0.00,0.00,1.00,0.00,12.00,3.00
75%,7.70,27.00,1.00,1.00,0.00,1.00,1.00,1.00,13.00,4.00
max,77.72,48.00,1.00,1.00,1.00,1.00,1.00,1.00,17.00,5.00

**Индексация**

In [18]:
data.head()

    wage  exper  union  goodhlth  black  female  married  service  educ  looks
0   5.73     30      0         1      0       1        1        1    14      4
1   4.28     28      0         1      0       1        1        0    12      3
2   7.96     35      0         1      0       1        0        0    10      4
3  11.57     38      0         1      0       0        1        1    16      3
4  11.42     27      0         1      0       0        1        0    16      3

In [19]:
data['exper'].head()

0    30
1    28
2    35
3    38
4    27
Name: exper, dtype: int64

In [20]:
data.exper.head()

0    30
1    28
2    35
3    38
4    27
Name: exper, dtype: int64

**loc и iloc**

In [24]:
data.loc[0:5, ['wage', 'female']]

    wage  female
0   5.73       1
1   4.28       1
2   7.96       1
3  11.57       0
4  11.42       0
5   3.91       1

In [25]:
data.iloc[:,2:4].head()

   union  goodhlth
0      0         1
1      0         1
2      0         1
3      0         1
4      0         1

**Логическая индексация**

In [12]:
data[data['female'] == 1]['wage'].mean(), \
data[data['female'] == 0]['wage'].mean()

(4.299357798165136, 7.3688228155339734)

In [26]:
data[(data['female'] == 0) & (data['married'] == 1)]['wage'].median(), \
data[(data['female'] == 0) & (data['married'] == 0)]['wage'].median()

(6.710000000000001, 5.0649999999999995)

**Groupby**

In [28]:
data.groupby('looks').count()

       wage  exper  union  goodhlth  black  female  married  service  educ
looks
1        13     13     13        13     13      13       13       13    13
2       142    142    142       142    142     142      142      142   142
3       722    722    722       722    722     722      722      722   722
4       364    364    364       364    364     364      364      364   364
5        19     19     19        19     19      19       19       19    19

In [35]:
for look, sub in data.groupby('looks'):
    print (look, sub['wage'].mean())

1 4.621538461538462
2 5.328802816901409
3 6.504598337950134
4 6.299340659340659
5 7.38842105263158

In [36]:
for look, sub_df in data.groupby('looks'):
    print(look)
    
    # что угодно
    print(sub_df['goodhlth'].mean())

1
0.8461538461538461
2
0.9366197183098591
3
0.9210526315789473
4
0.9560439560439561
5
1.0

In [37]:
data.groupby('looks').mean()

       wage  exper  union  goodhlth  black  female  married  service   educ
looks
1      4.62  27.00   0.23      0.85   0.15    0.38     0.62     0.31  10.00
2      5.33  18.92   0.23      0.94   0.04    0.38     0.71     0.30  12.11
3      6.50  19.49   0.31      0.92   0.08    0.32     0.72     0.25  12.42
4      6.30  15.41   0.22      0.96   0.07    0.37     0.65     0.30  13.07
5      7.39  11.63   0.16      1.00   0.05    0.42     0.42     0.26  13.37

In [42]:
data.groupby('looks')[['wage', 'goodhlth']].agg(np.mean)

       wage  goodhlth
looks
1      4.62      0.85
2      5.33      0.94
3      6.50      0.92
4      6.30      0.96
5      7.39      1.00

In [43]:
data.groupby('looks')[['wage', 'exper']].agg(np.median)

       wage  exper
looks
1      3.46   32.0
2      4.60   18.0
3      5.63   18.0
4      5.24   12.5
5      4.81    8.0

**Сводная таблица**

In [44]:
pd.crosstab(data['married'], data['female'])

female     0    1
married
0        166  223
1        658  213

In [45]:
pd.crosstab(data['female'], data['married'])

married    0    1
female
0        166  658
1        223  213

In [46]:
data.head()

    wage  exper  union  goodhlth  black  female  married  service  educ  looks
0   5.73     30      0         1      0       1        1        1    14      4
1   4.28     28      0         1      0       1        1        0    12      3
2   7.96     35      0         1      0       1        0        0    10      4
3  11.57     38      0         1      0       0        1        1    16      3
4  11.42     27      0         1      0       0        1        0    16      3

In [47]:
pd.crosstab(data['wage'], data['female'])

female  0   1
wage
1.02    0   1
1.05    1   0
1.09    0   1
1.16    0   2
1.17    1   0
1.20    0   2
1.22    0   1
1.25    0   1
1.26    0   1
1.27    1   3
1.28    0   3
1.32    2   1
1.46    1   0
1.48    1   0
1.56    1   0
1.58    1   0
1.61    0   1
1.63    1   0
1.65    1   1
1.66    1   0
1.68    1   2
1.75    0   1
1.76    0   1
1.79    2   1
1.80    1   3
1.82    0   1
1.83    0   2
1.88    0   2
1.92    2  11
1.95    0   1
...    ..  ..
16.03   1   0
16.14   2   0
16.35   1   0
16.83   1   0
17.03   1   0
17.48   1   0
17.49   2   0
18.32   1   0
18.46   1   0
18.74   1   0
19.08   2   0
19.23   2   0
20.18   1   0
20.86   1   0
20.99   4   0
21.54   1   0
21.63   1   0
21.74   1   0
23.16   1   0
23.32   1   0
24.73   1   0
25.64   2   0
26.22   1   0
26.24   3   0
29.98   1   0
31.09   1   0
32.79   1   0
38.86   1   0
41.67   1   0
77.72   0   1

[520 rows x 2 columns]

In [17]:
pd.crosstab(data['female'], data['looks'])

looks   1   2    3    4   5
female
0       8  88  489  228  11
1       5  54  233  136   8

**Добавление столбцов (построение признаков)**

In [48]:
data['wage'].quantile(0.75)

7.695

In [49]:
data.quantile(0.75)

wage         7.7
exper       27.0
union        1.0
goodhlth     1.0
black        0.0
female       1.0
married      1.0
service      1.0
educ        13.0
looks        4.0
Name: 0.75, dtype: float64

In [50]:
data['is_rich'] = (data['wage'] > 
                   data['wage'].quantile(.75)).astype('int64')

In [51]:
data.head()

,wage,exper,union,goodhlth,black,female,married,service,educ,looks,is_rich
0,5.73,30,0,1,0,1,1,1,14,4,0
1,4.28,28,0,1,0,1,1,0,12,3,0
2,7.96,35,0,1,0,1,0,0,10,4,1
3,11.57,38,0,1,0,0,1,1,16,3,1
4,11.42,27,0,1,0,0,1,0,16,3,1

In [52]:
data['rubbish'] = .56 * data['wage'] + 0.32 * data['exper']

**map и apply**

In [55]:
def string_gender(female):
    return 'female' if female else 'male'

In [56]:
d = {1:'union', 0: 'non-union'}

In [57]:
d[1]

'union'

In [58]:
d[0]

'non-union'

In [60]:
data['union'].head()

0    0
1    0
2    0
3    0
4    0
Name: union, dtype: int64

In [61]:
data['union'].map(d).head()

0    non-union
1    non-union
2    non-union
3    non-union
4    non-union
Name: union, dtype: object

In [62]:
data['female'].apply(lambda female: 'female' if female else 'male').head()

0    female
1    female
2    female
3      male
4      male
Name: female, dtype: object